src/InformationRegisters/Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий/Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТарифУказанВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>УслугаПакета</name>
    <type>
      <types>CatalogRef.Scan_НоменклатураУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛогистическийТип</name>
    <type>
      <types>CatalogRef.Scan_ТипыПродуктовЛогистика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КолеснаяФормула</name>
    <type>
      <types>CatalogRef.Scan_КолесныеФормулыИзделий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресПолучения</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий/ManagerModule.bsl
//rarus tenkam 10.08.2017 mantis 10589 +++
Функция ПолучитьПоследниеДанныеРегистра(УслугаПакета, ЛогистическийТип, СпособДоставки, КолеснаяФормула, АдресПолучения, АдресДоставки,НаДату = Неопределено) Экспорт
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДата();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.ТарифУказанВручную,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.Стоимость
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СрезПоследних(
		|			&НаДату,
		|			УслугаПакета = &УслугаПакета
		|				И ЛогистическийТип = &ЛогистическийТип
		|				И КолеснаяФормула = &КолеснаяФормула
		|				И СпособДоставки = &СпособДоставки
		|				И АдресПолучения = &АдресПолучения
		|				И АдресДоставки = &АдресДоставки) КАК Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних";
	
	Запрос.УстановитьПараметр("АдресДоставки", АдресДоставки);
	Запрос.УстановитьПараметр("АдресПолучения", АдресПолучения);
	Запрос.УстановитьПараметр("КолеснаяФормула", КолеснаяФормула);
	Запрос.УстановитьПараметр("ЛогистическийТип", ЛогистическийТип);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("СпособДоставки", СпособДоставки);
	Запрос.УстановитьПараметр("УслугаПакета", УслугаПакета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Стоимость",Неопределено);
	СтруктураВозврата.Вставить("ТарифУказанВручную",Ложь);
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураВозврата.Стоимость = ВыборкаДетальныеЗаписи.Стоимость;
		СтруктураВозврата.ТарифУказанВручную = ВыборкаДетальныеЗаписи.ТарифУказанВручную;
	КонецЕсли;
	Возврат СтруктураВозврата;		
КонецФункции
//rarus tenkam 10.08.2017 mantis 10589 ---
